html/projects/retired.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-02-03 Tue 22:39 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Retired</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/style.css" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Retired</h1>
<p>
These projects have completed their life cycle and I am no longer using them and will no longer use them. In many cases, however, the project could conceivably enter utilization again, e.g. putting a website back online.
</p>
<div id="outline-container-org1677af8" class="outline-2">
<h2 id="org1677af8"><span class="section-number-2">1.</span> Academic Projects</h2>
<div class="outline-text-2" id="text-1">
<ol class="org-ol">
<li><a href="https://digitalcollections.bowdoin.edu/view/4961/">Physics BA Honors Thesis</a>, 2023: reuse of N95 FFRs helps mitigate the effects of shortages. UV-C exposure is an ideal method for the decontamination necessary for FFR reuse. We design and program a ray tracing simulator in MATLAB to characterize the distribution of scattered photons in N95 FFRs.</li>
<li><a href="https://gitlab.com/lorenzohess/eddy-current-brakes-ergometer">Eddy Current Brake Ergometer for PHYS 3010</a>, 2022: building parts of an upper body ergometer with eddy current brakes.</li>
<li><a href="https://gitlab.com/lorenzohess/me3310-stretcher-cad">Folding Stretcher CAD Model for ME 3310</a>, 2024:</li>
<li><a href="https://gitlab.com/lorenzohess/es-1310-cad-files">CAD Files for ES 1310</a>, 2023:</li>
</ol>
</div>
</div>
<div id="outline-container-org147895e" class="outline-2">
<h2 id="org147895e"><span class="section-number-2">2.</span> Software</h2>
<div class="outline-text-2" id="text-2">
<ol class="org-ol">
<li><a href="https://github.com/lorenzohess/qubes-awesomewm-rice">AwesomeWM Desktop Rice for Qubes OS</a>, 2023: configuration and scripting for the Awesome Window Manager and other desktop environment tools for Arch Linux.</li>
<li><a href="https://gitlab.com/lorenzohess/xml-orlando-furioso">XML Orlando Furioso</a>, 2023: Ariosto&rsquo;s <i>Orlando Furioso</i> encoded as XML, down to each word.</li>
</ol>
</div>
</div>
<div id="outline-container-orgabf3d9b" class="outline-2">
<h2 id="orgabf3d9b"><span class="section-number-2">3.</span> Mechanical</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org240ef2c" class="outline-3">
<h3 id="org240ef2c"><span class="section-number-3">3.1.</span> Laser Cutting</h3>
<div class="outline-text-3" id="text-3-1">
<ol class="org-ol">
<li><a href="https://gitlab.com/lorenzohess/greek-alphabetex">Greek Alphabet in LaTeX</a>, 2024: aka &ldquo;Greek AlphabeTeX&rdquo;, a reference to the LaTeX greek alphabet letters.</li>
<li><a href="https://gitlab.com/lorenzohess/self-complementary-graphs-gift">Self-Complementary Graphs</a>, 2024: visualization of fourteen self-complementary graphs (n = 1, 4, 5, 8).</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgbf8e2cd" class="outline-2">
<h2 id="orgbf8e2cd"><span class="section-number-2">4.</span> Suspended</h2>
<div class="outline-text-2" id="text-4">
<p>
These projects were begun, even if only in the Concept Stage, but were suspended for one reason or another. They could theoretically be resumed under certain conditions:
</p>
<ol class="org-ol">
<li><a href="https://gitlab.com/lhess2021/degorge">degOrge</a>: a calorie tracker in Emacs Org Mode, a <a href="https://www.merriam-webster.com/dictionary/portmanteau">portmanteau</a> of &ldquo;de-gorge&rdquo; and &ldquo;Org&rdquo;.
<ul class="org-ul">
<li>Implementation Stage: 50% of the code. I had difficulty wrapping my mind around writing Elisp code that was more than a single Emacs config setting or custom function.</li>
<li>Why Suspended: I discovered it was easy enough to count calories using written notes.</li>
</ul></li>
<li>Bookseer: an attempt at using computer vision and OCR to identify library book spine labels and extract their Library of Congress codes, with the eventual goal of building a handheld device to identify misplaced books.
<ul class="org-ul">
<li>Implementation Stage: somewhat reliable label identification and somewhat reliable OCR.</li>
<li>Why Suspended: we learned that library books contain RFID chips in the spine and that existing products can scan these chips to identify misplaced books. Our product would only have value to the niche group of libraries with no RFID system or no money for those RFID scanner.</li>
</ul></li>
<li><a href="https://gitlab.com/lhess2021/nextcloud-temp-systray">Nextcloud temp systray</a>: an idea for a systemtray widget that would disply the CPU temperature of my home Raspberry Pi server.
<ul class="org-ul">
<li>Implementation Stage: I verified an online tutorial for a systray icon with mutable state.</li>
<li>Why Suspended: I got a fan for my Pi and now it stays cool enough that I don&rsquo;t need to monitor the temp.</li>
</ul></li>
<li><a href="https://gitlab.com/lhess2021/qubes-split-passman">Qubes split passman</a>: a split password manager system for Qubes OS which allows a password manager (e.g. Bitwarden) running in a vault Qube to send information (e..g a password) to other Qubes.
<ul class="org-ul">
<li>Implementation Stage: working python scripts for Bitwarden.</li>
<li>Why Suspended: I switched away from Qubes (to Arch Linux).</li>
</ul></li>
<li>Latex Preview Pane Rewrite: an attempt at rewriting the Latex Preview Pane Emacs package because it had several bugs.
<ul class="org-ul">
<li>Implementation Stage: I understood most of the LPP code.</li>
<li>Why Suspended: I switched to Sioyek for PDF viewing, and it offered better functionality than LPP ever could.</li>
</ul></li>
<li>Simple Web Calculator: attempt at programming with friends to learn Git and web development.
<ul class="org-ul">
<li>Implementation Stage: 30% of the code.</li>
<li>Why Suspended: we had learned enough and were busy with classes.</li>
</ul></li>
<li>Threatmodel.info Website: a website which offers a template for users to design a threatmodel based on Techlore&rsquo;s matrix (link).
<ul class="org-ul">
<li>Implementation Stage: basic version working.</li>
<li>Why Suspended: it needs more features to actually be useful, and I lost interest.</li>
</ul></li>
<li>Shower Shaving Station</li>
</ol>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="email">Email: <a href="mailto:lorenzohess@tutanota.com">lorenzohess@tutanota.com</a></p>
<p class="date">Created: 2026-02-03 Tue 22:39</p>
</div>
</body>
</html>
